#### Terraform Format and Style 🖌`success`


#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_process_monetary_transactions.data.archive_file.lambda_zip: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0bcdb674a44652343]
module.s3.aws_s3_bucket.sftp_bucket: Refreshing state... [id=scrooge-bank-g3t3-sftp-bucket]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.s3.aws_s3_bucket.sftp_bucket has been deleted
  - resource "aws_s3_bucket" "sftp_bucket" {
      - arn                         = "arn:aws:s3:::scrooge-bank-g3t3-sftp-bucket" -> null
      - bucket                      = "scrooge-bank-g3t3-sftp-bucket" -> null
        id                          = "scrooge-bank-g3t3-sftp-bucket"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.dynamodb.aws_dynamodb_table.main will be created
  + resource "aws_dynamodb_table" "main" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "business_transactions_table"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.iam.aws_iam_role.process_monetary_transactions_lambda_role will be created
  + resource "aws_iam_role" "process_monetary_transactions_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "process_monetary_transactions_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.sftp_user_role will be created
  + resource "aws_iam_role" "sftp_user_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "transfer.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sftp_user_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy.sftp_user_policy will be created
  + resource "aws_iam_role_policy" "sftp_user_policy" {
      + id     = (known after apply)
      + name   = "sftp_user_policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "process_monetary_transactions_lambda_role"
    }

  # module.kms.aws_kms_key.aurora will be created
  + resource "aws_kms_key" "aurora" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "for aurora (pls work)"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.s3.aws_s3_bucket.sftp_bucket will be created
  + resource "aws_s3_bucket" "sftp_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "scrooge-bank-g3t3-sftp-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.transfer_family.aws_transfer_server.sftp_server will be created
  + resource "aws_transfer_server" "sftp_server" {
      + arn                    = (known after apply)
      + domain                 = "S3"
      + endpoint               = (known after apply)
      + endpoint_type          = "PUBLIC"
      + force_destroy          = false
      + host_key_fingerprint   = (known after apply)
      + id                     = (known after apply)
      + identity_provider_type = "SERVICE_MANAGED"
      + protocols              = [
          + "SFTP",
        ]
      + security_policy_name   = "TransferSecurityPolicy-2018-11"
      + tags_all               = (known after apply)

      + protocol_details (known after apply)
    }

  # module.transfer_family.aws_transfer_user.sftp_user will be created
  + resource "aws_transfer_user" "sftp_user" {
      + arn                 = (known after apply)
      + home_directory      = "/scrooge-bank-g3t3-sftp-bucket"
      + home_directory_type = "PATH"
      + id                  = (known after apply)
      + role                = (known after apply)
      + server_id           = (known after apply)
      + tags_all            = (known after apply)
      + user_name           = "sftp_user"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @yijiyap, Action: `pull_request`*